{"intents": [
{"tag":"salutari",
"patterns":["Hey","Hello","Salut","Buna ziua","buna ziua","Salutare","Buna","care-i treaba?","Cum iti merge?"],
"responses":["Salut!","Hey!","Salutare","Ce pot face pentru tine?","Hey! Cu ce te pot ajuta?"]
},


{"tag":"goodbye",
"patterns":["Trebuie sa plec.Ne auzim mai tarziu!","ne auzim mai tarziu","ma grabesc si va trebui sa plec","la revedere","a fost o adevarata placere sa vorbesc cu tine!","ne mai auzim!","nu","Nu","Momentan nu","Deocamndata,nu","Poate mai tarziu"],
"responses":["Imi pare sincer rau sa aud ca trebuie sa pleci :(","Ne auzim mai tarziu!Pa!","Sa ai o zi frumoasa!","Ramas bun,prietene!","Mi-a parut bine ca am reusit sa vorbim astazi! Toate cele bune! Salut!","OK!Nu uita ca sunt aici daca ai nevoie de mine!Ne mai auzim,prietene!"]
},

{
"tag":"varsta",
"patterns":["Cati ani ai?","Care e varsta ta?","Ce varsta ai?"],
"responses":["Am 22 de ani.Tu cati ani ai?","Am 22 de ani.Tu?"]
},

{"tag":"ocupatie",
"patterns":["Cu ce te ocupi?","Care este ocupatia ta?","Care sunt hobby-urile tale?"],
"responses":["Am fost programat pentru a comunica cu oamenii.","Imi place sa citesc si sa comunic."]
},

{
"tag":"nume",
"patterns":["Care este numele tau?","Cum as putea sa iti spun?","Cum te numesti?"],
"responses":["Numele meu este Chatbot.Tu cum te numesti?","Ma numesc Chatbot","Ma cheama Chatbot.Pe tine cum te cheama?","Ma numesc Chatbot, insa toti cei apropiati imi spun Chatty.Tu cum te numesti,prietene?"]
},

{
"tag":"web",
"patterns":["Deschide Chrome!","Lanseaza browser-ul google chrome","deschide un browser"],
"responses":["Imediat...","Cu siguranta!","De indata!"]
},

{
"tag":"internet",
"patterns":["Hai sa navigam pe internet!"],
"responses":["Haide!Pe ce site ai dori sa intram?","Imediat?Ce site doresti sa accesezi?","Bineinteles,doar spune-mi site-ul,iar de restul ma ocup eu!"]},

{
"tag":"screenshot",
"patterns":["Fa un screenshot!","Fa un screenshot acum","Poti sa faci un screenshot?"],
"responses":["Gata! Il poti gasi in folder-ul proiectului intitulat print-screens!"]},

{
"tag":"ask",
"patterns":[" Ce faci?"],
"responses":["Multumesc de intrebare.Stau la dispozitia ta si incerc sa comunic cu tine si sa iti usurez munca pe acest dispozitiv."]},

{
"tag":"age",
"patterns":["19 ani","Am 19 ani","19"],
"responses":["Multi ani inainte! Asta inseamna ca te-ai nascut in 2001,nu-i asa?","In ce luna esti nascut?"]},

{
"tag":"yes",
"patterns":["da","Da"],
"responses":["Super","Super.Cu ce as putea sa te ajut mai departe?","Cool","Interesant","Foarte tare","Pot face si altceva pentru tine?","Foarte tare.Cu ce altceva as putea sa te mai ajut?"]},

{
"tag":"month",
"patterns":["august","sunt nascut in august"],
"responses":["Nice!Se pare ca suntem nascuti in aceeasi luna!","Ce coincidenta!","Ce tare!La fel ca si mine,de altfel!"]},

{
"tag":"month2",
"patterns":["ianuarie","februarie","martie","aprilie","mai","iunie","iulie","septembrie","octombrie","noiembrie","decembrie"],
"responses":["Ma gandeam ca poate suntetm nascuti in aceeasi luna,insa m-am inselat! :)"]}, 

{
"tag":"english",
"patterns":["Te pricepi la engleza?","Cunosti limba engleza?"],
"responses":["Din pacate,nu prea.Am fost programat sa vorbesc fluent doar limba romana.Daca tu te pricepi la engleza,poate ma vei invata si pe mine intr-o buna zi,caci sunt dornic de a invata!","Imi pare rau,dar nu stiu engleaza deloc.Poate intr-o buna zi ma vei invata si pe mine,daca doresti."]},

{
"tag":"english-ans",
"patterns":["Sigur ca da","Te invat cu placere","Bineinteles"],
"responses":["Cool!","Super tare,multumesc!","Mersi mult!"]},

{
"tag":"nume_interlocutor",
"patterns":["Medeea","Ma numesc Medeea","Numele meu este Medeea","medeea"],
"responses":["Incantat de cunostina,Medeea! Te pot ajuta cu ceva?","Presimt ca asta e inceputul unei frumoase prietenii,Medeea!Spune-mi, te rog, cu ce as putea sa te ajut astazi? "]},

{
"tag":"music",
"patterns":["As vrea sa ascult niste muzica","haide sa ascultam niste muzica"],
"responses":["Imediat!","Chiar voiam sa iti propun asta!","Desigur!"]},

{
"tag": "inginerie_industriala",
"patterns": ["Ce este ingineria industriala","Care este scopul ingineriei industriale","Ce fac inginerii industriali","Cum pot deveni un inginer industrial","Care sunt domeniile de specializare în ingineria industriala"],
"responses": ["Ingineria industriala este o ramura a ingineriei care se ocupă de proiectarea, dezvoltarea si imbunatatirea sistemelor, proceselor si echipamentelor utilizate in productie si in alte domenii industriale.","Scopul ingineriei industriale este de a imbunatati eficienta si eficacitatea sistemelor si proceselor industriale, reducand costurile si imbunatatind calitatea produselor si serviciilor.","Inginerii industriali pot lucra in diverse industrii, inclusiv in productie, logistica, transport, sanatate, energie, constructii, design industrial si consultanta.","Pentru a deveni un inginer industrial, este necesar sa obtineti o diploma de licenta în inginerie industriala sau intr-un domeniu asemanator. Este de asemenea util sa aveti abilităti in matematica, fizica, informatica si management.","Domeniile de specializare în ingineria industriala includ ingineria de productie, ingineria de calitate, ingineria logistica, ingineria de proces, ingineria de sistem si ingineria de management."]},

{
"tag": "inginerie_economica",
"patterns": ["Ce este ingineria economica","Care este scopul ingineriei economica","Ce fac inginerii industriali","Cum pot deveni un inginer economist","Care sunt domeniile de specializare în ingineria economica?"],
"responses": ["Specializarea de Inginerie Economica Industriala este cuprinsa in cadrul domeniului Inginerie si Management si se preda in limba romana", "Scopul ingineriei economice este acela de a forma prin studii interdisciplinare (ingineresti, manageriale si economice), specialisti de sinteza, capabili sa proiecteze, sa organizeze si sa conduca sisteme complexe.","Inginerii economisti pot lucra in diverse domenii, inclusiv in productie, logistica, transport, sanatate, energie, constructii, design industrial si consultanta tehnica sau economica.","Pentru a deveni un inginer economist, este necesar sa obtineti o diploma de licenta în inginerie economica sau intr-un domeniu asemanator. Este de asemenea util sa aveti abilităti in matematica, fizica, informatica si management.","Absolventul va fi un specialist capabil sa proiecteze, sa organizeze, sa gestioneze si in final sa conduca sisteme integrate alcatuite din oameni, materiale si echipamente, precum si sa genereze ansamblul de relatii care racordeaza aceste sisteme la mediul economico-social in care ele evolueaza."]},

{
"tag":"merci",
"patterns":["Multumesc mult!","mersi","multumesc ca m-ai ajutat"],
"responses":["Oricand! Ma bucur ca am putut sa te ajut! Spune-mi te rog daca mai pot face si altceva pentru tine!","Cu multa placere! Te mai pot ajuta si cu altceva?"]},
{
"tag": "descriere_proiect",
"patterns": ["Ce presupune proiectul de diploma?", "Ce fel de piesa se proiecteaza?", "Ce tipuri de prelucrari se vor realiza?"],
"responses": ["Proiectul de diploma este alcatuit din trei capitole ce implica: - pentru capitolul 1, proiectarea si prelucrarea unei piese, folosind diferite metode de prelucrare, cum ar fi strunjire, frezare, adancire, gaurire, rectificare s.a.m.d, calcularea timpilor aferenti acestor metode. - pentru cap.2: progrmarea si conducerea productiei pentru un set de 3 piese. - pentru cap.3: exista posibilitatea de a alege intre a introduce un dispozitiv realizat in cadrul proiectului de Produse, Procese si Sisteme 2 si, respectiv, o parte de cercetare stiintifa cu privire la o tema aleasa de dvs."]
},
{
"tag": "primul_capitol",
"patterns": ["Ce presupune primul capitol din proiectul de diploma?", "Ce tipuri de prelucrari se pot vor realiza?"],
"responses": ["In cadrul primului capitol se realizeaza proiectarea si prelucrarea unei piese, folosind diferite metode de prelucrare, cum ar fi strunjire, frezare, adancire, gaurire, rectificare s.a.m.d.", "Capitolul 1 consta in: efectuarea de calcule, demonstratii si aplicatii in inginerie si management, elaborarea si interpretarea documentatiei tehnico-economice de produs si, respectiv, determinarea de elemente ale sistemelor tehnologice de semifabricare si de prelucrare."]
},
{
"tag": "capitol_doi",
"patterns": ["Ce presupune al doilea capitol din proiectul de diploma?"],
"responses": ["In cadrul capitolului al doilea se realizeaza progrmarea si conducerea productiei pentru un set de 3 piese din cadrul unui ansamblu. Se urmareste dobandirea cunostintelor practice cu privire la activitatile si instrumentele decizionale specifice programarii si conducerii productiei produselor."]
},
{
"tag": "capitol_trei",
"patterns": ["Ce presupune al treilea capitol din proiectul de diploma?"],
"responses": ["In vederea realizarii capitolului al treilea exista posibilitatea de a alege intre a introduce un dispozitiv realizat in cadrul proiectului de Produse, Procese si Sisteme 2 si, respectiv, o parte de cercetare stiintifica cu privire la o tema aleasa de dvs."]
},
{
"tag": "proiectare",
"patterns": ["Cum se realizeaza proiectarea piesei?", "Ce factori sunt luati in considerare in proiectare?", "Care este procesul de proiectare?"],
"responses": ["Proiectarea procesului tehnologic de realizare a unui piese are ca obiectiv final elaborarea unui document tehnologic care sa contina toate informatiile necesare fabricarii (prelucrarii) piesei. Documentul tehnologic poate fi, dupa caz: fisa tehnologica, planul de operatii, programul piesa etc. Calitatea executiei piesei depinde, in mare masura, de corectitudinea, rigurozitatea si calitatea intocmirii documentatiei tehnologice."]
},
{
"tag": "prelucrare",
"patterns": ["Cum se realizeaza prelucrarea piesei?", "Care sunt etapele prelucrarii?", "Ce metode de prelucrare sunt folosite?"],
"responses": ["Prelucrarea piesei implica mai multe etape, cum ar fi strunjirea, frezarea, adancirea, gaurirea, rectificarea si tratamentul termic. Fiecare etapa are propriile sale metode si tehnici, care depind de geometria si materialul piesei."]
},
{
"tag": "strunjire",
"patterns": ["Ce este strunjirea?", "Cum se realizeaza strunjirea?", "Cand este necesara strunjirea?"],
"responses": ["Strunjirea este o metoda de prelucrare prin care se indeparteaza materialul suplimentar din piesa, folosind o masina de strunjire. Aceasta este necesara atunci cand este necesara obtinerea unor dimensiuni precise sau forme specifice."]
},
{
"tag": "frezare",
"patterns": ["Ce este frezarea?", "Cum se realizeaza frezarea?", "Cand este necesara frezarea?"],
"responses": ["Frezarea este o metoda de prelucrare prin care se indeparteaza materialul suplimentar din piesa, folosind o freza. Aceasta este necesara atunci cand este necesara obtinerea unor forme complexe sau suprafete plane."]
},
{
"tag": "adancire",
"patterns": ["Ce este adancirea?", "Cum se realizeaza adancirea?", "Cand este necesara adancirea?"]}
]}






